# Core tools
brew "fzf"
brew "zoxide"
brew "bat"
brew "lsd"
brew "yazi"
brew "fd"

# Shell
brew "sheldon"
brew "starship"
brew "atuin"

# Editor
brew "neovim"

# Development
brew "gh"
brew "git-delta"
brew "tmux"
brew "typescript-language-server"
brew "crit"

# Shell lint (used by CI lint job; keep versions roughly in sync)
brew "shellcheck"
brew "shfmt"
brew "actionlint"

# Kubernetes / YAML
brew "yq"
brew "stern"
brew "yaml-language-server"

# Runtime management
brew "mise"

# GUI Apps
cask "ghostty"
cask "zed"
cask "font-hack-nerd-font"
