# Core tools
brew "fzf"
brew "zoxide"
brew "bat"
brew "lsd"
brew "yazi"
brew "fd"

# Shell
brew "sheldon"
brew "starship"
brew "atuin"

# Editor
brew "helix"

# Development
brew "gh"
brew "git-delta"
brew "tmux"
brew "typescript-language-server"

# Kubernetes / YAML
brew "yq"
brew "stern"

# Runtime management
brew "mise"

# GUI Apps
cask "ghostty"
cask "cursor"
cask "font-hack-nerd-font"
